* >Natural Source Header 000000
* :Mode S
* :CP IBM01140
* <Natural Source Header
* MAP2: PROTOTYPE VERSION 820 --- CREATED BY NAT 0802060006 ---
* INPUT USING MAP 'XXXXXXXX'
*     #ACTION #KEY #MSG #PROGRAM #TIME #TITLE1 #TITLE2 #VALID-ACTIONS
*     EMPLOC.#ISN EMPLOC.ADDRESS-LINE(*) EMPLOC.AREA-CODE EMPLOC.BIRTH
*     EMPLOC.BONUS(*,*) EMPLOC.CITY EMPLOC.COUNTRY EMPLOC.CURR-CODE(*)
*     EMPLOC.DEPT EMPLOC.FIRST-NAME EMPLOC.JOB-TITLE EMPLOC.LANG(*)
*     EMPLOC.LEAVE-DUE EMPLOC.LEAVE-END(*) EMPLOC.LEAVE-START(*)
*     EMPLOC.LEAVE-TAKEN EMPLOC.MAR-STAT EMPLOC.MIDDLE-NAME EMPLOC.NAME
*     EMPLOC.PHONE EMPLOC.POST-CODE EMPLOC.SALARY(*) EMPLOC.SEX
DEFINE DATA PARAMETER
1 #ACTION (A001)
1 #KEY (A008)
1 #MSG (A070)
1 #PROGRAM (A008)
1 #TIME (T)
1 #TITLE1 (A040)
1 #TITLE2 (A040)
1 #VALID-ACTIONS (A012)
1 EMPLOC.#ISN (P08.0)
1 EMPLOC.ADDRESS-LINE (A020/00001:00005)
1 EMPLOC.AREA-CODE (A006)
1 EMPLOC.BIRTH (T)
1 EMPLOC.BONUS (P09.0/00001:00005,00001:00005)
1 EMPLOC.CITY (A020)
1 EMPLOC.COUNTRY (A003)
1 EMPLOC.CURR-CODE (A003/00001:00005)
1 EMPLOC.DEPT (A006)
1 EMPLOC.FIRST-NAME (A020)
1 EMPLOC.JOB-TITLE (A025)
1 EMPLOC.LANG (A003/00001:00005)
1 EMPLOC.LEAVE-DUE (N02.0)
1 EMPLOC.LEAVE-END (N08.0/00001:00005)
1 EMPLOC.LEAVE-START (N08.0/00001:00005)
1 EMPLOC.LEAVE-TAKEN (N02.0)
1 EMPLOC.MAR-STAT (A001)
1 EMPLOC.MIDDLE-NAME (A020)
1 EMPLOC.NAME (A020)
1 EMPLOC.PHONE (A015)
1 EMPLOC.POST-CODE (A010)
1 EMPLOC.SALARY (P09.0/00001:00005)
1 EMPLOC.SEX (A001)
END-DEFINE
FORMAT PS=023 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
* MAP2: MAP PROFILES *****************************        410***********
* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
* 023079        N0NNUCN             X        01 SYSPROF NL             *
************************************************************************
INPUT          (     IP=OFF                                           /*
                                                                       )
 002T #TIME  (AD=ODL EM=MM'/'DD'/'YYYY ) /*.03U010 T               .
 021T #TITLE1  (AD=OIL ) /*.01D040 A040            .
 071T #TIME  (AD=ODL EM=HH':'II':'SS ) /*.02D008 T               .
/
 021T #TITLE2  (AD=OIL ) /*.01D040 A040            .
 071T #PROGRAM  (AD=ODL ) /*.01D008 A008            .
/
 004T 'Action:'
 012T #VALID-ACTIONS  (AD=ODL ) /*.01D012 A012            .
 025T #ACTION  (AD=MILT'_' ) /*.99D001 A001            .
 028T 'Personnel Id:'
 042T #KEY  (AD=MILT'_' ) /*.99U008 A008            .
 051T 'ISN:'
 056T EMPLOC.#ISN  (AD=ODL ) /*.01D008 P08.0           .
 068T 'Mar'
/
 002T 'First'
 024T 'Middle'
 046T 'Last Name'
 068T 'Stat'
 074T 'Sex'
/
 002T EMPLOC.FIRST-NAME  (AD=MILT'_' ) /*.99D020 A020            .
 024T EMPLOC.MIDDLE-NAME  (AD=MILT'_' ) /*.99D020 A020            .
 046T EMPLOC.NAME  (AD=MILT'_' ) /*.99D020 A020            .
 069T EMPLOC.MAR-STAT  (AD=MILT'_' ) /*.99D001 A001            .
 075T EMPLOC.SEX  (AD=MILT'_' ) /*.99D001 A001            .
/
 002T 'Address:'
 011T EMPLOC.ADDRESS-LINE (1)  (AD=MILT'_' ) /*.99D020 A020            .
   /**A1000050000100001000010000100001100005001001000001000HV
 033T 'City/ZipCode/Cntry'
 053T 'Birth:'
 060T EMPLOC.BIRTH  (AD=MILT EM=MMDDYYYY ) /*.99D008 T               .
 069T '(MMDDYYYY)'
/
 011T EMPLOC.ADDRESS-LINE (2)  (AD=MILT'_' ) /*.99D020 A020            .
 033T EMPLOC.CITY  (AD=MILT'_' ) /*.99D020 A020            .
/
 011T EMPLOC.ADDRESS-LINE (3)  (AD=MILT'_' ) /*.99D020 A020            .
 033T EMPLOC.POST-CODE  (AD=MILT'_' ) /*.99D010 A010            .
 045T EMPLOC.COUNTRY  (AD=MILT'_' ) /*.99D003 A003            .
 050T 'Phone:'
 057T EMPLOC.AREA-CODE  (AD=MILT'_' ) /*.99D006 A006            .
 064T EMPLOC.PHONE  (AD=MILT'_' ) /*.99D015 A015            .
/
 011T EMPLOC.ADDRESS-LINE (4)  (AD=MILT'_' ) /*.99D020 A020            .
 033T 'Dept'
 043T 'Leave Start / End Curr Code Salary'
/
 011T EMPLOC.ADDRESS-LINE (5)  (AD=MILT'_' ) /*.99D020 A020            .
 033T EMPLOC.DEPT  (AD=MILT'_' ) /*.99D006 A006            .
 043T EMPLOC.LEAVE-START (1)  (AD=MILT'_' ) /*.99D008 N08.0           .
   /**A1000050000100001000010000100001100005001001000001000HV
 052T EMPLOC.LEAVE-END (1)  (AD=MILT'_' ) /*.99D008 N08.0           .
   /**A1000050000100001000010000100001100005001001000001000HV
 064T EMPLOC.CURR-CODE (1)  (AD=MILT'_' ) /*.99D003 A003            .
   /**A1000050000100001000010000100001100005001001000001000HV
 071T EMPLOC.SALARY (1)  (AD=MIRT'_' ) /*.99D009 P09.0           .
   /**A1000050000100001000010000100001100005001001000001000HV
/
 002T 'Leave Due:'
 013T EMPLOC.LEAVE-DUE  (AD=MILT'_' ) /*.99D002 N02.0           .
 016T 'Leave Taken:'
 029T EMPLOC.LEAVE-TAKEN  (AD=MILT'_' ) /*.99D002 N02.0           .
 043T EMPLOC.LEAVE-START (2)  (AD=MILT'_' ) /*.99D008 N08.0           .
 052T EMPLOC.LEAVE-END (2)  (AD=MILT'_' ) /*.99D008 N08.0           .
 064T EMPLOC.CURR-CODE (2)  (AD=MILT'_' ) /*.99D003 A003            .
 071T EMPLOC.SALARY (2)  (AD=MIRT'_' ) /*.99D009 P09.0           .
/
 002T 'Lang:'
 008T EMPLOC.LANG (1)  (AD=MILT'_' ) /*.99D003 A003            .
   /**A1000050000100001000010000100001100001005001000001000HV
 012T EMPLOC.LANG (2)  (AD=MILT'_' ) /*.99D003 A003            .
 016T EMPLOC.LANG (3)  (AD=MILT'_' ) /*.99D003 A003            .
 020T EMPLOC.LANG (4)  (AD=MILT'_' ) /*.99D003 A003            .
 024T EMPLOC.LANG (5)  (AD=MILT'_' ) /*.99D003 A003            .
 043T EMPLOC.LEAVE-START (3)  (AD=MILT'_' ) /*.99D008 N08.0           .
 052T EMPLOC.LEAVE-END (3)  (AD=MILT'_' ) /*.99D008 N08.0           .
 064T EMPLOC.CURR-CODE (3)  (AD=MILT'_' ) /*.99D003 A003            .
 071T EMPLOC.SALARY (3)  (AD=MIRT'_' ) /*.99D009 P09.0           .
/
 002T 'Title:'
 009T EMPLOC.JOB-TITLE  (AD=MILT'_' ) /*.99D025 A025            .
 043T EMPLOC.LEAVE-START (4)  (AD=MILT'_' ) /*.99D008 N08.0           .
 052T EMPLOC.LEAVE-END (4)  (AD=MILT'_' ) /*.99D008 N08.0           .
 064T EMPLOC.CURR-CODE (4)  (AD=MILT'_' ) /*.99D003 A003            .
 071T EMPLOC.SALARY (4)  (AD=MIRT'_' ) /*.99D009 P09.0           .
/
 043T EMPLOC.LEAVE-START (5)  (AD=MILT'_' ) /*.99D008 N08.0           .
 052T EMPLOC.LEAVE-END (5)  (AD=MILT'_' ) /*.99D008 N08.0           .
 064T EMPLOC.CURR-CODE (5)  (AD=MILT'_' ) /*.99D003 A003            .
 071T EMPLOC.SALARY (5)  (AD=MIRT'_' ) /*.99D009 P09.0           .
/
 002T 'Bonus:'
 009T EMPLOC.BONUS (1,1)  (AD=MILT'_' ) /*.99D009 P09.0           .
   /**A2000050000500001000010000100001120005005001000001000HV
 019T EMPLOC.BONUS (1,2)  (AD=MILT'_' ) /*.99D009 P09.0           .
 029T EMPLOC.BONUS (1,3)  (AD=MILT'_' ) /*.99D009 P09.0           .
 039T EMPLOC.BONUS (1,4)  (AD=MILT'_' ) /*.99D009 P09.0           .
 049T EMPLOC.BONUS (1,5)  (AD=MILT'_' ) /*.99D009 P09.0           .
/
 009T EMPLOC.BONUS (2,1)  (AD=MILT'_' ) /*.99D009 P09.0           .
 019T EMPLOC.BONUS (2,2)  (AD=MILT'_' ) /*.99D009 P09.0           .
 029T EMPLOC.BONUS (2,3)  (AD=MILT'_' ) /*.99D009 P09.0           .
 039T EMPLOC.BONUS (2,4)  (AD=MILT'_' ) /*.99D009 P09.0           .
 049T EMPLOC.BONUS (2,5)  (AD=MILT'_' ) /*.99D009 P09.0           .
/
 009T EMPLOC.BONUS (3,1)  (AD=MILT'_' ) /*.99D009 P09.0           .
 019T EMPLOC.BONUS (3,2)  (AD=MILT'_' ) /*.99D009 P09.0           .
 029T EMPLOC.BONUS (3,3)  (AD=MILT'_' ) /*.99D009 P09.0           .
 039T EMPLOC.BONUS (3,4)  (AD=MILT'_' ) /*.99D009 P09.0           .
 049T EMPLOC.BONUS (3,5)  (AD=MILT'_' ) /*.99D009 P09.0           .
/
 009T EMPLOC.BONUS (4,1)  (AD=MILT'_' ) /*.99D009 P09.0           .
 019T EMPLOC.BONUS (4,2)  (AD=MILT'_' ) /*.99D009 P09.0           .
 029T EMPLOC.BONUS (4,3)  (AD=MILT'_' ) /*.99D009 P09.0           .
 039T EMPLOC.BONUS (4,4)  (AD=MILT'_' ) /*.99D009 P09.0           .
 049T EMPLOC.BONUS (4,5)  (AD=MILT'_' ) /*.99D009 P09.0           .
/
 009T EMPLOC.BONUS (5,1)  (AD=MILT'_' ) /*.99D009 P09.0           .
 019T EMPLOC.BONUS (5,2)  (AD=MILT'_' ) /*.99D009 P09.0           .
 029T EMPLOC.BONUS (5,3)  (AD=MILT'_' ) /*.99D009 P09.0           .
 039T EMPLOC.BONUS (5,4)  (AD=MILT'_' ) /*.99D009 P09.0           .
 049T EMPLOC.BONUS (5,5)  (AD=MILT'_' ) /*.99D009 P09.0           .
/
/
 002T #MSG  (AD=ODL ) /*.01D070 A070            .
/
/
* MAP2: VALIDATION *****************************************************
* MAP2: END OF MAP *****************************************************
END
