DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP IBM01140
/* <Natural Source Header
1 EMPLOC
  2 PERSONNEL-ID (A8)
  2 FIRST-NAME (A20)
  2 NAME (A20)
  2 MIDDLE-NAME (A20)
  2 MAR-STAT (A1)
  2 SEX (A1)
  2 BIRTH (T)
  2 ADDRESS-LINE (A20/1:5)
  2 CITY (A20)
  2 POST-CODE (A10)
  2 COUNTRY (A3)
  2 AREA-CODE (A6)
  2 PHONE (A15)
  2 DEPT (A6)
  2 JOB-TITLE (A25)
  2 INCOME (1:5)
    3 CURR-CODE (A3)
    3 SALARY (P9)
    3 BONUS (P9/1:5)
  2 LEAVE-DUE (N2)
  2 LEAVE-TAKEN (N2)
  2 LEAVE-BOOKED (1:5)
    3 LEAVE-START (N8)
    3 LEAVE-END (N8)
  2 LANG (A3/1:5)
  2 #ISN (P8)
  2 #KEY (A8)
END-DEFINE
