* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
* >NATURAL SOURCE HEADER 000000
* :MODE S
* :CP WINDOWS-1252
* :LINEINCREMENT 10
* <NATURAL SOURCE HEADER
DEFINE DATA
PARAMETER
1 #START-NAME (A20)
1 #END-NAME (A20)
1 #NAME (A20/50)
1 #FIRST-NAME (A20/50)
1 #PERSONNEL-ID (A8/50)
LOCAL
1 EMP VIEW OF EMPLOYEES
 2 NAME
 2 PERSONNEL-ID
 2 FIRST-NAME
 1 #I (P2)

END-DEFINE

READ (50) EMP BY NAME STARTING FROM #START-NAME THRU #END-NAME
ADD 1 TO #I
ASSIGN #PERSONNEL-ID(#I) = PERSONNEL-ID
ASSIGN #NAME(#I) = NAME
ASSIGN #FIRST-NAME(#I) = FIRST-NAME

END-READ

END
